// -----// IR Dump After AutoInputConversionPipelinePass (iree-auto-input-conversion) //----- //
module {
  func.func @test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %c0 = arith.constant 0 : index
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After IREEImportPublicPass (iree-import-public) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %c0 = arith.constant 0 : index
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After ImportMLProgramPass (iree-import-ml-program) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %c0 = arith.constant 0 : index
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After SanitizeModuleNamesPass (iree-sanitize-module-names) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %c0 = arith.constant 0 : index
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After ConvertShardToFlowPass (iree-convert-shard-to-flow) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After DemoteF64ToF32Pass (iree-input-conversion-demote-f64-to-f32) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1:2 = util.call @_test_simple_argmax_4x16(%0) : (tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>)
    %2 = hal.tensor.export %1#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %3 = hal.tensor.export %1#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %2, %3 : !hal.buffer_view, !hal.buffer_view
  }
  util.func private @_test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) attributes {hal.abi.convention = #hal.abi.convention<synchronous>} {
    %cst = arith.constant 0xFC00 : f16
    %c0_i32 = arith.constant 0 : i32
    %0 = tensor.empty() : tensor<4x16xf16>
    %1 = tensor.empty() : tensor<4x16xi32>
    %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %5 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %5 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func private @_test_simple_argmax_4x16(%arg0: tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>) attributes {hal.abi.convention = #hal.abi.convention<synchronous>} {
  %cst = arith.constant 0xFC00 : f16
  %c0_i32 = arith.constant 0 : i32
  %0 = tensor.empty() : tensor<4x16xf16>
  %1 = tensor.empty() : tensor<4x16xi32>
  %2 = linalg.fill ins(%cst : f16) outs(%0 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %3 = linalg.fill ins(%c0_i32 : i32) outs(%1 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %4:2 = iree_linalg_ext.arg_compare dimension(2) ins(%arg0 : tensor<4x16x128256xf16>) outs(%2, %3 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %5 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %5 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  util.return %4#0, %4#1 : tensor<4x16xf16>, tensor<4x16xi32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1:2 = util.call @_test_simple_argmax_4x16(%0) : (tensor<4x16x128256xf16>) -> (tensor<4x16xf16>, tensor<4x16xi32>)
  %2 = hal.tensor.export %1#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %3 = hal.tensor.export %1#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %2, %3 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
module {
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After AssignTargetDevicesPass (iree-hal-assign-target-devices) //----- //
module attributes {hal.device.targets = [#hal.device.alias<"hip"> : !hal.device]} {
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After MaterializeTargetDevicesPass (iree-hal-materialize-target-devices) //----- //
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #hal.device.alias<"hip"> : !hal.device
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDevicePromisesPass (iree-hal-resolve-device-promises) //----- //
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #hal.device.alias<"hip"> : !hal.device
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDeviceAliasesPass (iree-hal-resolve-device-aliases) //----- //
#executable_target_rocm_hsaco_fb = #hal.executable.target<"rocm", "rocm-hsaco-fb", {abi = "hip", iree.encoding.resolver = #iree_gpu.gpu_encoding_resolver<>, iree_codegen.default_tuning_spec = #rocm.builtin.tuning_module<"iree_default_tuning_spec_gfx942.mlir">, iree_codegen.target_info = #iree_gpu.target<arch = "gfx942", features = "", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<MFMA_F32_16x16x16_BF16>, <MFMA_F32_32x32x8_BF16>, <MFMA_F32_16x16x32_F8E5M2FNUZ>, <MFMA_F32_16x16x32_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_I32_16x16x32_I8>, <MFMA_I32_32x32x16_I8>, <MFMA_F64_16x16x4_F64>, <MFMA_F32_16x16x4_F32>, <MFMA_F32_16x16x16_F16>, <MFMA_F32_32x32x8_F16>], subgroup_size_choices = [64], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 65536, max_workgroup_counts = [2147483647, 2147483647, 2147483647], max_load_instruction_bits = 128, simds_per_wgp = 4, vgpr_space_bits = 16384, dma_sizes = [32]>>, ukernels = "none"}>
#device_target_hip = #hal.device.target<"hip", [#executable_target_rocm_hsaco_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_hip
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After VerifyDevicesPass (iree-hal-verify-devices) //----- //
#executable_target_rocm_hsaco_fb = #hal.executable.target<"rocm", "rocm-hsaco-fb", {abi = "hip", iree.encoding.resolver = #iree_gpu.gpu_encoding_resolver<>, iree_codegen.default_tuning_spec = #rocm.builtin.tuning_module<"iree_default_tuning_spec_gfx942.mlir">, iree_codegen.target_info = #iree_gpu.target<arch = "gfx942", features = "", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<MFMA_F32_16x16x16_BF16>, <MFMA_F32_32x32x8_BF16>, <MFMA_F32_16x16x32_F8E5M2FNUZ>, <MFMA_F32_16x16x32_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_I32_16x16x32_I8>, <MFMA_I32_32x32x16_I8>, <MFMA_F64_16x16x4_F64>, <MFMA_F32_16x16x4_F32>, <MFMA_F32_16x16x16_F16>, <MFMA_F32_32x32x8_F16>], subgroup_size_choices = [64], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 65536, max_workgroup_counts = [2147483647, 2147483647, 2147483647], max_load_instruction_bits = 128, simds_per_wgp = 4, vgpr_space_bits = 16384, dma_sizes = [32]>>, ukernels = "none"}>
#device_target_hip = #hal.device.target<"hip", [#executable_target_rocm_hsaco_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_hip
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After AttrBasedPipelinePass (iree-preprocessing-attr-based-pipeline) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After WarnOnUninitializedValuesPass (iree-global-opt-warn-on-uninitialized-values) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After StripDebugOpsPass (iree-util-strip-debug-ops) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After OptimizeIntArithmeticPass (iree-util-optimize-int-arithmetic) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedConvToConvPass (iree-global-opt-quantized-conv-to-conv) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedMatmulToMatmulPass (iree-global-opt-quantized-matmul-to-matmul) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After CanonicalizePass (iree-flow-canonicalize) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After RemoveZeroExtentTensorsPass (iree-global-opt-remove-zero-extent-tensors) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After DetachElementwiseFromNamedOpsPass (iree-global-opt-detach-elementwise-from-named-ops) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After SimplifyDepthwiseConvPass (simplify-depthwise-conv) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After EraseUnusedLinalgOperandsPass (iree-global-opt-erase-unused-linalg-operands) //----- //
#executable_target_rocm_hsaco_fb = #hal.executable.target<"rocm", "rocm-hsaco-fb", {abi = "hip", iree.encoding.resolver = #iree_gpu.gpu_encoding_resolver<>, iree_codegen.default_tuning_spec = #rocm.builtin.tuning_module<"iree_default_tuning_spec_gfx942.mlir">, iree_codegen.target_info = #iree_gpu.target<arch = "gfx942", features = "", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<MFMA_F32_16x16x16_BF16>, <MFMA_F32_32x32x8_BF16>, <MFMA_F32_16x16x32_F8E5M2FNUZ>, <MFMA_F32_16x16x32_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_I32_16x16x32_I8>, <MFMA_I32_32x32x16_I8>, <MFMA_F64_16x16x4_F64>, <MFMA_F32_16x16x4_F32>, <MFMA_F32_16x16x16_F16>, <MFMA_F32_32x32x8_F16>], subgroup_size_choices = [64], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 65536, max_workgroup_counts = [2147483647, 2147483647, 2147483647], max_load_instruction_bits = 128, simds_per_wgp = 4, vgpr_space_bits = 16384, dma_sizes = [32]>>, ukernels = "none"}>
#device_target_hip = #hal.device.target<"hip", [#executable_target_rocm_hsaco_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_hip
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After ExpandTensorShapesPass (iree-global-opt-expand-tensor-shapes) //----- //
#executable_target_rocm_hsaco_fb = #hal.executable.target<"rocm", "rocm-hsaco-fb", {abi = "hip", iree.encoding.resolver = #iree_gpu.gpu_encoding_resolver<>, iree_codegen.default_tuning_spec = #rocm.builtin.tuning_module<"iree_default_tuning_spec_gfx942.mlir">, iree_codegen.target_info = #iree_gpu.target<arch = "gfx942", features = "", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<MFMA_F32_16x16x16_BF16>, <MFMA_F32_32x32x8_BF16>, <MFMA_F32_16x16x32_F8E5M2FNUZ>, <MFMA_F32_16x16x32_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ>, <MFMA_F32_16x16x32_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ>, <MFMA_F32_32x32x16_F8E5M2FNUZ_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ>, <MFMA_F32_32x32x16_F8E4M3FNUZ_F8E5M2FNUZ>, <MFMA_I32_16x16x32_I8>, <MFMA_I32_32x32x16_I8>, <MFMA_F64_16x16x4_F64>, <MFMA_F32_16x16x4_F32>, <MFMA_F32_16x16x16_F16>, <MFMA_F32_32x32x8_F16>], subgroup_size_choices = [64], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 65536, max_workgroup_counts = [2147483647, 2147483647, 2147483647], max_load_instruction_bits = 128, simds_per_wgp = 4, vgpr_space_bits = 16384, dma_sizes = [32]>>, ukernels = "none"}>
#device_target_hip = #hal.device.target<"hip", [#executable_target_rocm_hsaco_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_hip
  util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0xFC00 : f16
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
    %1 = tensor.empty() : tensor<4x16xf16>
    %2 = tensor.empty() : tensor<4x16xi32>
    %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
    %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
    %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
    ^bb0(%arg1: f16, %arg2: f16):
      %8 = arith.cmpf ogt, %arg1, %arg2 : f16
      iree_linalg_ext.yield %8 : i1
    } -> tensor<4x16xf16>, tensor<4x16xi32>
    %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
    %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
    util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
  }
}


// -----// IR Dump After ConvertElementwiseToLinalgPass (convert-elementwise-to-linalg) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After RaiseSpecialOpsPass (iree-global-opt-raise-special-ops) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After DecomposeConcatPass (iree-global-opt-decompose-concat) //----- //
util.func public @test_simple_argmax_4x16(%arg0: !hal.buffer_view) -> (!hal.buffer_view, !hal.buffer_view) attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @test_simple_argmax_4x16(%input0: tensor<4x16x128256xf16>) -> (%output0: tensor<4x16xf16>, %output1: tensor<4x16xi32>)"}} {
  %c0_i32 = arith.constant 0 : i32
  %cst = arith.constant 0xFC00 : f16
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x16x128256xf16>
  %1 = tensor.empty() : tensor<4x16xf16>
  %2 = tensor.empty() : tensor<4x16xi32>
  %3 = linalg.fill ins(%cst : f16) outs(%1 : tensor<4x16xf16>) -> tensor<4x16xf16>
  %4 = linalg.fill ins(%c0_i32 : i32) outs(%2 : tensor<4x16xi32>) -> tensor<4x16xi32>
  %5:2 = iree_linalg_ext.arg_compare dimension(2) ins(%0 : tensor<4x16x128256xf16>) outs(%3, %4 : tensor<4x16xf16>, tensor<4x16xi32>) {
  ^bb0(%arg1: f16, %arg2: f16):
    %8 = arith.cmpf ogt, %arg1, %arg2 : f16
    iree_linalg_ext.yield %8 : i1
  } -> tensor<4x16xf16>, tensor<4x16xi32>
  %6 = hal.tensor.export %5#0 "output0" : tensor<4x16xf16> -> !hal.buffer_view
  %7 = hal.tensor.export %5#1 "output1" : tensor<4x16xi32> -> !hal.buffer_view
  util.return %6, %7 : !hal.buffer_view, !hal.buffer_view
}

// -----// IR Dump After GeneralizeLinalgNamedOpsPass (iree-global-opt-generalize-linalg-named-ops) //----- //
